In [1]:
import pandas as pd

In [2]:
data = {
    "Employee": ["Alice", "Bob", "Charlie", "Diana", "Ethan", "Fiona", "George"],
    "Region": ["East", "West", "East", "South", "North", "West", "South"],
    "Sales_Q1": [12000, 15000, 11000, 18000, 14000, 13000, 12500],
    "Sales_Q2": [13000, 16000, 10500, 20000, 14500, 12000, 15000]
}

df = pd.DataFrame(data)
print(df)

  Employee Region  Sales_Q1  Sales_Q2
0    Alice   East     12000     13000
1      Bob   West     15000     16000
2  Charlie   East     11000     10500
3    Diana  South     18000     20000
4    Ethan  North     14000     14500
5    Fiona   West     13000     12000
6   George  South     12500     15000

In [8]:
print(df.iloc[:3])

  Employee Region  Sales_Q1  Sales_Q2
0    Alice   East     12000     13000
1      Bob   West     15000     16000
2  Charlie   East     11000     10500

In [11]:
print(df.iloc[-2:])

  Employee Region  Sales_Q1  Sales_Q2
5    Fiona   West     13000     12000
6   George  South     12500     15000

In [14]:
# rows 2 to 5 and columns 1 to 3
print(df.iloc[2:6,1:4])

  Region  Sales_Q1  Sales_Q2
2   East     11000     10500
3  South     18000     20000
4  North     14000     14500
5   West     13000     12000

In [15]:
print(df.iloc[3,3])

20000

In [18]:
df.iloc[5,3] = (df.iloc[5,3]*1.10)
print(df.iloc[5])

Employee      Fiona
Region         West
Sales_Q1      13000
Sales_Q2    14520.0
Name: 5, dtype: object

In [27]:
# Compute the average total sales for the top 3 performers using iloc to slice the top rows after sorting.
df['Total_Sales'] = df['Sales_Q1'] + df['Sales_Q2']
df_sorted = df.sort_values('Total_Sales', ascending=False)
df_sorted

  Employee Region  Sales_Q1  Sales_Q2  Total_Sales
3    Diana  South     18000   20000.0      38000.0
1      Bob   West     15000   16000.0      31000.0
4    Ethan  North     14000   14500.0      28500.0
5    Fiona   West     13000   14520.0      27520.0
6   George  South     12500   15000.0      27500.0
0    Alice   East     12000   13000.0      25000.0
2  Charlie   East     11000   10500.0      21500.0

In [31]:
avg_top_3 = df_sorted.iloc[:3,-1].mean()
print(avg_top_3)

32500.0